{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"dropout_W": 0.0, "forget_bias_init": "one", "stateful": false, "init": "glorot_uniform", "unroll": false, "consume_less": "gpu", "activation": "tanh", "dropout_U": 0.0, "input_dim": 39, "U_regularizer": null, "W_regularizer": null, "b_regularizer": null, "input_length": null, "inner_init": "orthogonal", "name": "lstm_1", "output_dim": 512, "trainable": true, "input_dtype": "float32", "return_sequences": false, "inner_activation": "hard_sigmoid", "go_backwards": false, "batch_input_shape": [null, 32, 39]}}, {"class_name": "RepeatVector", "config": {"n": 32, "name": "repeatvector_1", "trainable": true}}, {"class_name": "LSTM", "config": {"b_regularizer": null, "output_dim": 512, "input_length": null, "dropout_W": 0.0, "forget_bias_init": "one", "inner_init": "orthogonal", "unroll": false, "name": "lstm_2", "init": "glorot_uniform", "stateful": false, "consume_less": "gpu", "activation": "tanh", "dropout_U": 0.0, "go_backwards": false, "trainable": true, "return_sequences": true, "U_regularizer": null, "inner_activation": "hard_sigmoid", "input_dim": 512, "W_regularizer": null}}, {"class_name": "LSTM", "config": {"b_regularizer": null, "output_dim": 512, "input_length": null, "dropout_W": 0.0, "forget_bias_init": "one", "inner_init": "orthogonal", "unroll": false, "name": "lstm_3", "init": "glorot_uniform", "stateful": false, "consume_less": "gpu", "activation": "tanh", "dropout_U": 0.0, "go_backwards": false, "trainable": true, "return_sequences": true, "U_regularizer": null, "inner_activation": "hard_sigmoid", "input_dim": 512, "W_regularizer": null}}, {"class_name": "TimeDistributed", "config": {"name": "timedistributed_1", "layer": {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "activation": "linear", "output_dim": 106, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "name": "dense_1"}}, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}], "keras_version": "1.0.7"}